In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

from numpy.random import randn

In [2]:
ser1 = Series([1,2,3,4],index=['A','B','C','D'])

ser1

A    1
B    2
C    3
D    4
dtype: int64

In [6]:
ser2 = ser1.reindex(['A','B','C','D','E','F'])

ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [7]:
ser2.reindex(['A','B','C','D','E','F','G'],fill_value=0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [8]:
ser3 = Series(['USA','Mexico','Canada'],index=[0,5,10])

ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [10]:
ranger = range(15)
ranger

range(0, 15)

In [11]:
ser3.reindex(ranger,method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [12]:
dframe = DataFrame(randn(25).reshape(5,5),index=['A','B','D','E','F'],
                   columns=['col1','col2','col3','col4','col5'])

dframe

       col1      col2      col3      col4      col5
A -1.222767 -0.309603  0.404290  0.741777  0.913606
B -0.833816 -0.087907  0.557138 -0.738372  1.051829
D  0.351884  0.079725  0.240551  1.857669  1.338772
E -0.538108 -0.180876  0.320964  0.337010 -0.617190
F -0.312973 -0.033812 -0.615611 -0.483386 -0.604325

In [13]:
dframe2 = dframe.reindex(['A','B','C','D','E','F'])

dframe2

       col1      col2      col3      col4      col5
A -1.222767 -0.309603  0.404290  0.741777  0.913606
B -0.833816 -0.087907  0.557138 -0.738372  1.051829
C       NaN       NaN       NaN       NaN       NaN
D  0.351884  0.079725  0.240551  1.857669  1.338772
E -0.538108 -0.180876  0.320964  0.337010 -0.617190
F -0.312973 -0.033812 -0.615611 -0.483386 -0.604325

In [14]:
new_columns = ['col1','col2','col3','col4','col5','col6']

In [15]:
dframe2.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A -1.222767 -0.309603  0.404290  0.741777  0.913606   NaN
B -0.833816 -0.087907  0.557138 -0.738372  1.051829   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D  0.351884  0.079725  0.240551  1.857669  1.338772   NaN
E -0.538108 -0.180876  0.320964  0.337010 -0.617190   NaN
F -0.312973 -0.033812 -0.615611 -0.483386 -0.604325   NaN

In [16]:
dframe

       col1      col2      col3      col4      col5
A -1.222767 -0.309603  0.404290  0.741777  0.913606
B -0.833816 -0.087907  0.557138 -0.738372  1.051829
D  0.351884  0.079725  0.240551  1.857669  1.338772
E -0.538108 -0.180876  0.320964  0.337010 -0.617190
F -0.312973 -0.033812 -0.615611 -0.483386 -0.604325

dframe.loc[['A','B','C','D','E','F'],new_columns]